In [115]:
import pandas as pd
import numpy as np

In [116]:
gender_df = pd.read_csv('C:/Users/nick.chedzoy_predict/Documents/Python/Projects/Titanic Survival Prediction/raw_data/gender_submission.csv') # Submission Structure
train_df = pd.read_csv('C:/Users/nick.chedzoy_predict/Documents/Python/Projects/Titanic Survival Prediction/raw_data/train.csv')
test_df = pd.read_csv('C:/Users/nick.chedzoy_predict/Documents/Python/Projects/Titanic Survival Prediction/raw_data/test.csv') # Individuals to predict

In [117]:
train_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [118]:
print(list(train_df.columns))

['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

In [119]:
def count_nans(df):
    na_df = df.isna().sum()
    return na_df

count_nans(train_df)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [120]:
count_nans(train_df)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [121]:
# Fill Missing Age Values by using most likley based on Class, Sex and Embarkment Location

train_df['Age'] = train_df.groupby(['Sex', 'Pclass', 'Embarked'])['Age'].transform(lambda x: x.fillna(x.median()))

In [122]:
count_nans(train_df)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              2
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [123]:
# Two passengers cannot be filled as are missing both Age and Embarked
train_df[train_df['Age'].isna()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,NaN,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,NaN,0,0,113572,80.0,B28,NaN

In [124]:
# Drop

train_df = train_df.dropna(subset=['Age', 'Embarked'])
count_nans(train_df)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [125]:
train_df['Cabin_cat'] = train_df['Cabin'].str[0]
train_df

C:\Users\nick.chedzoy_predict\AppData\Local\Temp\ipykernel_380\475880389.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train_df['Cabin_cat'] = train_df['Cabin'].str[0]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin_cat
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,C
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,NaN
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,B
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,23.0,1,2,W./C. 6607,23.4500,NaN,S,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,NaN

In [126]:
# Initial Stats

no_passengers = train_df['PassengerId'].nunique()
no_survivors = train_df['Survived'].sum()
perc_survived = (no_survivors / no_passengers) * 100
male_pas_no = len(train_df[train_df['Sex'] == 'male'])
fem_pas_no = len(train_df[train_df['Sex'] == 'female'])
male_survivors = len(train_df[(train_df['Sex'] == 'male') & (train_df['Survived'] == 1)])
fem_survivors = len(train_df[(train_df['Sex'] == 'female') & (train_df['Survived'] == 1)])
male_died = male_pas_no - male_survivors
fem_died = fem_pas_no - fem_survivors
male_surv_rate = (male_survivors / male_pas_no) *100
fem_surv_rate = (fem_survivors / fem_pas_no) * 100
class_1_tickets = len(train_df[train_df['Pclass'] == 1])
class_2_tickets = len(train_df[train_df['Pclass'] == 2])
class_3_tickets = len(train_df[train_df['Pclass'] == 3])
class_1_surv_rate = (len(train_df[(train_df['Pclass'] == 1) & (train_df['Survived'] == 1)]) / class_1_tickets) * 100
class_2_surv_rate = (len(train_df[(train_df['Pclass'] == 2) & (train_df['Survived'] == 1)]) / class_2_tickets) * 100
class_3_surv_rate = (len(train_df[(train_df['Pclass'] == 3) & (train_df['Survived'] == 1)]) / class_3_tickets) * 100



# Build a dictionary of your stats
stats = {
    "Metric": [
        "Total Passengers",
        "Total Survivors",
        "Percentage Survived",
        "Male Passengers",
        "Female Passengers",
        "Male Survivors",
        "Female Survivors",
        "Male Died",
        "Female Died",
        "Male Survival Rate (%)",
        "Female Survival Rate (%)",
        "First Class Tickets",
        "Second Class Tickets",
        "Third Class Tickets",
        "First Class Survivor Rate",
        "2nd Class Survivor Rate",
        "3rd Class Survivor Rate"
    ],
    "Value": [
        no_passengers,
        no_survivors,
        perc_survived,
        male_pas_no,
        fem_pas_no,
        male_survivors,
        fem_survivors,
        male_died,
        fem_died,
        male_surv_rate,
        fem_surv_rate,
        class_1_tickets,
        class_2_tickets,
        class_3_tickets,
        class_1_surv_rate,
        class_2_surv_rate,
        class_3_surv_rate
    ]
}

stats_df = pd.DataFrame(stats)

stats_df['Value'] = stats_df['Value'].round(1)

stats_df

                       Metric  Value
0            Total Passengers  889.0
1             Total Survivors  340.0
2         Percentage Survived   38.2
3             Male Passengers  577.0
4           Female Passengers  312.0
5              Male Survivors  109.0
6            Female Survivors  231.0
7                   Male Died  468.0
8                 Female Died   81.0
9      Male Survival Rate (%)   18.9
10   Female Survival Rate (%)   74.0
11        First Class Tickets  214.0
12       Second Class Tickets  184.0
13        Third Class Tickets  491.0
14  First Class Survivor Rate   62.6
15    2nd Class Survivor Rate   47.3
16    3rd Class Survivor Rate   24.2

In [127]:
def age_bucket(age):
    if age <= 12:
        return 'Child'
    elif age <= 19:
        return 'Teen'
    elif age <= 39:
        return 'Adult'
    elif age <= 59:
        return 'Mid_Adult'
    else:
        return 'Senior'

train_df['age_bucket'] = train_df['Age'].apply(age_bucket)

age_buckets_survivor_rates = (
    train_df.groupby('age_bucket')['Survived']
    .mean() * 100
).round(1)

print(age_buckets_survivor_rates)

age_stats_df = pd.DataFrame({
    "Metric": [f"{bucket} Survival Rate" for bucket in age_buckets_survivor_rates.index],
    "Value": age_buckets_survivor_rates.values
})

age_bucket
Adult        35.7
Child        58.0
Mid_Adult    38.2
Senior       24.0
Teen         42.2
Name: Survived, dtype: float64

C:\Users\nick.chedzoy_predict\AppData\Local\Temp\ipykernel_380\3764063154.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train_df['age_bucket'] = train_df['Age'].apply(age_bucket)

In [128]:
train_df['Cabin_cat'] = train_df.groupby(['Sex','Pclass','Embarked','age_bucket'])['Cabin_cat'] \
    .transform(lambda x: x.fillna(x.mode()[0] if not x.mode().empty else 'U'))

C:\Users\nick.chedzoy_predict\AppData\Local\Temp\ipykernel_380\2603428034.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train_df['Cabin_cat'] = train_df.groupby(['Sex','Pclass','Embarked','age_bucket'])['Cabin_cat'] \

In [129]:
count_nans(train_df)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
Cabin_cat        0
age_bucket       0
dtype: int64

In [130]:
# Now usinf Cabin Cat instead of cabin so drop Cabin

train_df = train_df.drop(columns = 'Cabin')

In [131]:
train_df['Fare'].describe()

count    889.000000
mean      32.096681
std       49.697504
min        0.000000
25%        7.895800
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

In [132]:
train_df['FareBucket'] = pd.qcut(train_df['Fare'], 4, labels=['Low','Mid','High','VeryHigh'])

fare_survival_rates = (
    train_df.groupby('FareBucket')['Survived']
    .mean() * 100
).round(1)

fare_stats_df = pd.DataFrame({
    "Metric": [f"{bucket} Fare Survival Rate" for bucket in fare_survival_rates.index],
    "Value": fare_survival_rates.values
})

C:\Users\nick.chedzoy_predict\AppData\Local\Temp\ipykernel_380\3051959336.py:4: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  train_df.groupby('FareBucket')['Survived']

In [133]:
location_survival_rates = (
    train_df.groupby('Embarked')['Survived']
    .mean() * 100
).round(1)

embarkment_stats_df = pd.DataFrame({
    "Metric": [f"{location} Embarked Survival Rate" for location in location_survival_rates.index],
    "Value": location_survival_rates.values
})

In [134]:
stats_df = pd.concat([stats_df, age_stats_df, fare_stats_df, embarkment_stats_df], ignore_index=True)
stats_df

                         Metric  Value
0              Total Passengers  889.0
1               Total Survivors  340.0
2           Percentage Survived   38.2
3               Male Passengers  577.0
4             Female Passengers  312.0
5                Male Survivors  109.0
6              Female Survivors  231.0
7                     Male Died  468.0
8                   Female Died   81.0
9        Male Survival Rate (%)   18.9
10     Female Survival Rate (%)   74.0
11          First Class Tickets  214.0
12         Second Class Tickets  184.0
13          Third Class Tickets  491.0
14    First Class Survivor Rate   62.6
15      2nd Class Survivor Rate   47.3
16      3rd Class Survivor Rate   24.2
17          Adult Survival Rate   35.7
18          Child Survival Rate   58.0
19      Mid_Adult Survival Rate   38.2
20         Senior Survival Rate   24.0
21           Teen Survival Rate   42.2
22       Low Fare Survival Rate   19.7
23       Mid Fare Survival Rate   30.4
24      High Fare Survival Rate   45.5
25  VeryHigh Fare Survival Rate   57.7
26     C Embarked Survival Rate   55.4
27     Q Embarked Survival Rate   39.0
28     S Embarked Survival Rate   33.7

In [135]:
train_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Cabin_cat,age_bucket,FareBucket
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,E,Adult,Low
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C,Adult,VeryHigh
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,G,Adult,Mid
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,C,Adult,VeryHigh
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,E,Adult,Mid
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S,D,Adult,Mid
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S,B,Teen,High
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,23.0,1,2,W./C. 6607,23.4500,S,G,Adult,High
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C,C,Adult,High
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q,F,Adult,Low

In [136]:
train_df['fam_mem'] = train_df['Parch'] + train_df['SibSp']

In [137]:
train_df.to_csv('cleaned_df.csv')

In [138]:
train_df['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)